# 3
# 1 1 3 8
# 3 2 2 7
# 4 3 8 1


#  0 0 8 0 0 0 0 0 0 0
#  0 0 0 0 0 0 0 0 0 0
#  0 0 0 0 0 0 0 0 0 0
# ####################
#  0 0 0 0 0 0 0 0 0 0
#  0 0 0 0 0 0 0 0 0 0
#  0 0 0 0 0 0 0 0 0 0
# ####################
#  0 0 0 0 0 0 0 0 0 0
#  0 7 0 0 0 0 0 0 0 0
#  0 0 0 0 0 0 0 0 0 0
# ####################
#  0 0 0 0 0 0 0 0 0 0
#  0 0 0 0 0 0 0 0 0 0
#  0 0 0 0 0 0 0 1 0 0


n = int(input())

count = [[[0 for i in range(10)] for j in range(3)] for k in range(4)]

for _ in range(n):
    b, f, r, v = map(int, input().split())

    count[b-1][f-1][r-1] += v

for i, x in enumerate(count):
    for j in x:
        # 通常printの最後には「\n」が自動的につけられるが、end=""を指定すると改行しなくなる。さらにその前に空白等の文字列をついかすることもできる。
        print(' ', end='')
        print(*j)

    if not i == 3:
        print("#"*20)



